app/Controllers/Attendance.php

    public function update($user_id = NULL)
    {
        $this->db = \Config\Database::connect();
        $modelAuth = new Model_Auth();

        $token = $this->request->getVar('token');
        $note = $this->request->getVar('note');
        //

        if(empty($token) || !$modelAuth->verify_token_key($token)){
            return $this->failUnauthorized('Access denied');
        }
        //
        if(empty($user_id)){
            return $this->fail('User ID not found', 400);
        }
        //
        $checkOutcheck = $this->db->table('crm_attendance')->where('user_id',$user_id)->where('DATE(in_time)',date('Y-m-d'))->where('status','pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `crm_attendance`
WHERE `user_id` = '3'
AND DATE(in_time) = '2024-05-03'
AND `status` = 'incomplete'

            "status" => "pending",
            "note" => $note
        );
        $this->db->table('crm_attendance')->where('status','incomplete')->where('user_id',$user_id)->update($data);
---
UPDATE `crm_attendance` SET `out_time` = '2024-05-03 16:25:20', `status` = 'pending', `note` = NULL
WHERE `status` = 'incomplete'
AND `user_id` = '3'