app/Controllers/Auth.php

SELECT *
FROM `crm_users`
WHERE `email` = 'test@gmail.com'
AND `status` = 'active'
AND `deleted` = 0
AND `disable_login` = 0
---
    public function index() {
        $this->db = \Config\Database::connect();
        $modelAuth = new Model_Auth();
        //
        $email = $this->request->getGet('email');
        $password = $this->request->getGet('password');
        //
        if(empty($email)){
            return $this->fail('email is required', 400);
        }if(empty($password)){
            return $this->fail('password is required', 400);
        }
        //
        $builder = $this->db->table('crm_users');
        //
        $builder->where('email',$email);
        $builder->where('status','active');
        $builder->where('deleted',0);
        $builder->where('disable_login',0);
        //
        $list_data = $builder->get()->getRow();