app/Controllers/Blog.php

SELECT *
FROM `blog`
WHERE `blog`.`deleted_at` IS NULL
AND `blog`.`id` = '1'
---
    public function show($id)
    {
        $blogs = new BlogModel();
        $blog = $blogs->find($id);