app/Controllers/Project.php

INSERT INTO `crm_projects` (`title`, `description`, `client_id`, `start_date`, `deadline`, `price`, `labels`, `status`, `estimate_id`, `order_id`, `created_date`, `created_by`) VALUES ('test from postman', NULL, '2', NULL, NULL, '150', NULL, 'open', 0, 0, '2024-05-09 09:43:51', '1')
---
        $data["created_date"] = date('Y-m-d H:i:s');
        $data["created_by"] = $id;
        //
        $this->db->table('crm_projects')->insert($data);

SELECT *
FROM `crm_projects`
WHERE `id` = '2'
UPDATE `crm_projects` SET `deleted` = 1
WHERE `id` = '2'
---
    public function delete($id = null)
    {
        $this->db = \Config\Database::connect();
        $modelAuth = new Model_Auth();
        //
        $token = $this->request->getVar('token');
        //
        if(empty($token) || !$modelAuth->verify_token_key($token)){
            return $this->failUnauthorized('Access denied');
        }
        //
        $query = $this->db->table('crm_projects');
        $query->where('id',$id);
        $result = $query->get()->getRow();
        //
        if($result){
            //
            $query = $this->db->table('crm_projects');
            $query->where('id',$id);
            $query->update(['deleted' => 1]);