app/Controllers/Ticket.php

INSERT INTO `crm_tickets` (`title`, `client_id`, `project_id`, `ticket_type_id`, `created_by`, `created_at`, `last_activity_at`, `labels`, `assigned_to`, `requested_by`) VALUES ('test from postman', '1', 0, '1', '2', '2024-05-05 10:22:39', '2024-05-05 10:22:39', NULL, 0, 0)
---
            "assigned_to" => $assigned_to ? $assigned_to : 0,
            "requested_by" => $requested_by ? $requested_by : 0
        );
        $this->db->table('crm_tickets')->insert($data);

SELECT *
FROM `crm_tickets`
WHERE `id` = '6'
UPDATE `crm_tickets` SET `deleted` = 1
WHERE `id` = '6'
---
    public function delete($id = null)
    {
        $this->db = \Config\Database::connect();
        $modelAuth = new Model_Auth();
        //
        $token = $this->request->getVar('token');
        //
        if(empty($token) || !$modelAuth->verify_token_key($token)){
            return $this->failUnauthorized('Access denied');
        }
        //
        $query = $this->db->table('crm_tickets');
        $query->where('id',$id);
        $result = $query->get()->getRow();
        //
        if($result){
            //
            $query = $this->db->table('crm_tickets');
            $query->where('id',$id);
            $query->update(['deleted' => 1]);