app/Models/Model_Auth.php

    function verify_token_key($token){
        //
        if(((strlen($token) % 2) != 0)  || !ctype_xdigit($token)){
            return false;
        }
        //
        $password = hex2bin($token);
        $builder = $this->db->table('crm_users');
        $builder->where('password',$password);
        $count = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `crm_users`
WHERE `password` = '$2a$12$wZHyLGtT3glFD1vW42KjzuxS16YN5MM0VXA7b4h242XDUmJ4oxgMO'